"""
미래도시
- 방문 판매원 A는 많은 회사가 모여 있는 공중 미래 도시에 있다.
- 공중 미래 도시에는 1번부터 N번까지의 회사가 있으며 특정 회사끼리는 도로로 연결되어 있다.
- A는 현재 1번 회사에 위치해 있으며 X번 회사에 방문에 물건을 판매하고자 한다.
- 도로가 연결된 회사 끼리는 양방향으로 이동이 가능하고 회사 간 이동거리는 모두 1로 동일하다.
- A는 X번 회사에 가기 전 K번 회사에 잠시 들렸다 가는 것이 목표이다.
- 방문 판매원 A가 가능한 한 빠르게 이동하고자 할때 회사 사이를 이동하게 되는 최소 시간을 계산하는 프로그램을 작성하시오.

입력 조건
- 첫째 줄에 전체 회사의 개수 N과 경로의 개수 M이 공백으로 구분되어 차례대로 주어진다.(1 <= N, M <= 100)
- 둘째 줄부터 M + 1번째 줄에는 연결된 두 회사의 번호가 공백으로 구분되어 주어진다.
- M + 2번째 줄에는 X와 K가 공백으로 구분되어 차례대로 주어진다.(1 <= K <= 100)

출력 조건
- 첫째 줄에 방문 판매원 A가 K번 회사를 거쳐 X번 회사로 가는 최소 이동 시간을 출력한다.
- 만약 X번 회사에 도달할 수 없다면 -1을 출력한다.
"""

INF = int(1e9) # 무한을 의미하는 값으로 10억 설정

# 노드의 개수 및 간선의 개수를 입력받기
n, m = map(int, input().split())
# 2차원 리스트(그래프 표현)를 만들고, 모든 값을 무한으로 초기화
graph = [[INF] * (n + 1) for _ in range(n + 1)]

# 자기 자신으로 가는 비용은 0으로 초기화
for a in range(1, n + 1):
    for b in range(1, n + 1):
        if a == b:
            graph[a][b] = 0

# 각 간선에 대한 정보를 입력받아 그 값으로 초기화
for _ in range(m):
    # A와 B가 서로에게 가는 비용은 1이라고 설정
    a, b = map(int, input().split())
    graph[a][b] = 1
    graph[b][a] = 1

# 최종 목적지 노드 X와 거쳐갈 노드 K를 입력 받기
x, k = map(int, input().split())

# 점화식(D[ab] = min(D[ab], D[ak] + D[kb]))에 따라 플로이드 워셜 알고리즘 수행
for k in range(1, n + 1):
    for a in range(1, n + 1):
        for b in range(1, n + 1):
            graph[a][b] = min(graph[a][b], graph[a][k] + graph[k][b])

# 수행 결과 출력          
distance = graph[1][k] + graph[k][x]

 # 도달할 수 없는 경우 "-1" 출력
if distance >= INF:
     print("-1")
else:
    print(distance)