"""
DFS(깊이 우선 탐색 알고리즘)
- DFS의 동작 과정은 다음과 같다.
    1. 탐색 시작 노드를 스택에 삽입하고 방문 처리를 한다.
    2. 스택의 최상단 노드에 방문하지 않은 인접 노드가 있으면 그 인접 노드를 스택에 넣고 방문처리를 한다.
       방문하지 않은 인접 노드가 없으면 스택에서 최상단 노드를 꺼낸다.
    3. 2의 과정을 더 이상 수행할 수 없을 때까지 반복한다.
- 노드의 탐색 순서는 노드가 스택에 들어간 순서이다.
- 데이터의 개수가 N개인 경우 O(N)의 시간 소요
"""

# DFS 메서드 정의
def dfs(graph, v, visited):
    # 현재 노드를 방문 처리
    visited[v] = True
    print(v, end=' ') # end=' ' : 줄 바꿈 하지 않음

    # 현재 노드와 연결된 다른 노드를 재귀적으로 방문
    for i in graph[v]: # 현재 노드와 연결된 노드 확인
        if not visited[i]: # 해당 연결 노드가 방문한 적이 없다면
            dfs(graph, i, visited) # 해당 노드에 대해 재귀적으로 함수 수행

# 각 노드가 연결된 정보를 리스트 자료형으로 표현(2차원 리스트)
# n 번째 행은 n번 노드가 연결되어 있는 노드의 번호를 의미
graph = [
    [],             # 0번 노드 -> 존재 X
    [2, 3, 8],      # 1번 노드 -> 2번, 3번, 8번과 연결
    [1, 7],         # 이하 생략
    [1, 4, 5],
    [3, 5],
    [3, 4],
    [7],
    [2, 6, 8],
    [1, 7]
]

# 각 노드의 방문 여부를 확인하는 1차원 리스트 정의(각 인덱스는 0 ~ 8번 노드에 상응)
visited = [False] * 9 # default = False, 방문 시 = True

# 정의된 DFS 함수 호출
dfs(graph, 1, visited)