"""
개미 전사
- 개미 전사가 부족한 식량을 충당하고자 메두기 마을의 식량창고를 공격한다.
- 메뚜기 마을에는 여러 개의 일직선으로 이어진 식량창고가 있다.
- 각 식량창고는 정해진 수의 식량을 저장하고 있으며 개미 전사는 식량창고를 선택적으로 약탈하여 식량을 빼앗을 예정이다.
- 메뚜기 정찰병들은 일직선상에 존재하는 식량창고 중에서 서로 인접한 식량창고가 공격받으면 바로 알아챌 수 있다.
- 따라서 개미 전사가 정찰병에서 들키지 않고 식량창고를 약탈하기 위해서는 최소 한 칸 이상 떨어진 식량창고를 약탈해야 한다.
- 개미 전사는 최대한 많은 식량을 얻기를 원한다.
- 식량창고 N개에 대한 정보가 주어졌을 때 얻을 수 있는 식량의 최댓값을 구하는 프로그램을 작성하시오.

입력 조건
- 첫째 줄에 식량창고 개수 N이 주어진다.(3 <= N <= 100)
- 둘째 줄에 공백으로 구분되어 각 식량창고에 저장된 식량의 개수 K가 주어진다.(0 <= K <= 1,000)

출력 조건
- 첫째 줄에 개미 전사가 얻을 수 있는 식량의 최댓값을 출력하시오.
"""

# 점화식
# a[i] = max(a[i-1], a[i-2] + k)
# i번째 창고를 털 때 최대 식량은 a[i-1]까지의 창고를 털때의 최댓값과 a[i-2]와 현재 i번째 창고의 식량 수(k)를 합친 값중 더 큰 값이다.

# 정수 N을 입력받기
n = int(input())
# 모든 식량 정보 입력받기
array = list(map(int, input().split()))

# 앞서 계산된 결과를 저장하기 위한 DP 테이블 초기화
d = [0] * 100 # i번째 창고까지에서 털 수 있는 식량의 최댓값을 저장

# 보텀업 방식 다이나믹 프로그래밍 진행
d[0] = array[0]
d[1] = max(array[0], array[1])
for i in range(2, n): # 2부터 n-1 까지
    # i-2에 위치한 창고를 털면 i에 위치한 창고 역시 털 수 있다.
    # i-1에 위치한 창고를 털면 i에 위치한 창고는 털 수 없다.
    d[i] = max(d[i - 1], d[i - 2] + array[i])

# 계산 결과 출력
print(d[n - 1])