"""
게임 개발
- 게임 캐릭터가 맵 안에서 움직이는 시스템을 개발한다.
- 캐릭터는 1 * 1 크기의 정사각형으로 이루어진 N * M 크기의 직사각형으로, 각각의 칸은 육지 또는 바다이다.
- 캐릭터는 동서남북 중 한 곳을 바라본다.
- 맵의 각 칸은 (A, B)로 나타낼 수 있고, A는 북쪽으로부터 떨어진 칸의 개수, B는 서쪽으로부터 떨어진 칸의 개수이다.
- 캐릭터는 상하좌우로 움직일 수 있고, 바다로 되어 있는 공간에는 갈 수 없다.
- 캐릭터의 움직임을 설정하기 위한 매뉴얼은 다음과 같다.
    1. 현재 위치에서 현재 방향을 기준으로 왼쪽 방향(반시계 방향으로 90도 회전한 방향)부터 차례대로 갈 곳을 정한다.
    2. 캐릭터의 바로 왼쪽 방향에 아직 가보지 않은 칸이 존재한다면, 왼쪽 방향으로 회전한 다음 왼쪽으로 한 칸을 전진한다.
       왼쪽 방향에 가보지 않은 칸이 없다면, 왼쪽 방향으로 회전만 수행하고 1단계로 돌아간다.
    3. 만약 네 방향 모두 이미 가본 칸이거나 바다로 되어 있는 칸인 경우에는, 바라보는 방향을 유지한 채로 한 칸 뒤로 가고 1단계로 돌아간다.
       단, 이때 뒤쪽 방향이 바다인 칸이라 뒤로 갈 수 없는 경우에는 움직임을 멈춘다.
- 매뉴얼에 따라 캐릭터를 이동시킨 뒤에, 캐릭터가 방문한 칸의 개수를 출력하는 프로그램을 만드시오.

입력 조건
- 첫째 줄에 맵의 세로 크기 N과 가로 크기 M을 공백으로 구분하여 입력한다. (3 <= N, M <= 50)
- 둘째 줄에 게임 캐릭터가 있는 칸의 좌표 (A, B)와 바라보는 방향 d가 각각 서로 공백으로 구분하여 주어진다.
  방향 d의 값으로는 다음과 같이 4가지가 존재한다.
  <0 : 북쪽, 1 : 동쪽, 2 : 남쪽, 3 : 서쪽>
- 셋째 줄부터 맵이 육지인지 바다인지에 대한 정보가 주어진다. N개의 줄에 맵의 상태가 북쪽부터 남쪽 순서대로,
  각 줄의 데이터는 서쪽부터 동쪽 순서대로 주어진다. 맵의 외곽은 항상 바다로 되어 있다.
  <0 : 육지, 1: 바다>
- 처음에 게임 캐릭터가 위치한 칸의 상태는 항상 육지이다.

출력 조건
- 첫째 줄에 이동을 마친 후 캐릭터가 방문한 칸의 수를 출력한다.
"""
# 2020/10/06

# N, M을 공백으로 구분하여 입력받기
n, m = map(int, input().split())

# 방문한 위치를 지정하기 위한 맵을 생성하여 모두 0으로 초기화
# 해당 리스트는 캐릭터의 방문 여부를 저장하는 역할
d = [[0] * m for _ in range(n)] # 리스트 컴프리헨션(p.422 참조)

# 현재 캐릭터의 X 좌표, Y 좌표, 방향을 입력받기
x, y, direction =  map(int, input().split())
d[x][y] = 1 # 캐릭터의 초기 좌표에 대해서 방문한 것으로 처리

# 전체 맵 정보를 입력받기
array = []
for i in range(n):
    array.append(list(map(int, input().split())))
    # 0 1 2 3 4 로 입력했을 시
    # 다음과 같이 저장 array = [[0, 1, 2, 3, 4]]

# 북, 동, 남, 서 방향 정의
dx = [-1, 0, 1, 0] # 행 이동
dy = [0, 1, 0, -1] # 열 이동

# 좌회전
def turn_left():
    global direction # 전역 변수로 선언된 direction 사용하기 위함
    direction -= 1
    # 북쪽에서 좌회전 시 서쪽을 바라보는 것으로 설정
    if direction == -1: 
        direction = 3

# 시뮬레이션
count = 1
turn_time = 0 # 방향 전환 횟수
while True:
    turn_left() # 왼쪽으로 회전
    # 다음 이동 예상 좌표
    nx = x + dx[direction]
    ny = y + dy[direction]
    # 회전한 이후 정면의 지역 방문 여부 확인
    if d[nx][ny] == 0 and array[nx][ny] == 0:
        # 방문한 적이 없는 육지일 경우 이동
        d[nx][ny] = 1
        x, y = nx, ny
        count += 1
        turn_time = 0
        continue
    else:
        # 방문한 경험이 있거나 바다인 경우
        turn_time += 1

    # 네 방향 모두 갈 수 없는 경우
    if turn_time == 4:
        nx = x - dx[direction]
        ny = y - dy[direction]

        # 뒤로 이동할 수 있으면 뒤로 이동
        if array[nx][ny] == 0:
            x, y = nx, ny
        # 뒤 역시 바다로 막혀있는 경우
        else:
            break
        turn_time = 0

print(count)
